{
  "additional_commands": [
    {
      "label": "help",
      "about": "View all commands"
    },
    {
      "label": "clear",
      "about": "Clear the screen"
    },
    {
      "label": "history",
      "about": "To know about history"
   },
    {
      "label": "setname",
      "about": "To replace default 'visitor' name with your name"
    },
    {
      "label": "theme",
      "about": "To customize theme"
    },
    {
      "label": "resume",
      "about": "To download resume"
    }
  ],
  "options": [
    {
      "label": "about",
      "about": "To know about me",
      "value": "Hi! I'm Miguel Mendez, a software engineer currently working on fraud detection with Liberty Mutual in Dallas, Texas. This is my portfolio, where I show off what I've created, what I learned, and where I've been. Feel free to play around with this interactive portfolio to learn more about me."
    },
    {
      "label": "skills",
      "about": "To know about my skills",
      "value": "I'm a versatile full-stack software developer, capable of turning ideas into robust web applications. My experience expands from splashy react web applications that users love, to scalable backend AI systems serving millions of requests, creating and maintaining SQL databases to maintain data integrity and query efficiency, and even a little bit of blockchain development as well. <br /> <br /> I have expertise with React, Node.js, Redux, Tailwind CSS, RESTful APIs, Python, Java, JavaScript, TypeScript, Bun.js, Solidity, as well as backend database administration and management with MySQL, and PostgresSQL as well."
    },
    {
      "label": "experience",
      "about": "To know about my experience",
      "value": "I've been working professionaly as a software engineer since 2023, and obtained my Bachelors of Science in Computer Science from the University of Texas at Dallas in 2023.",
      "data": [
        {
          "label": "LibertyMutual",
          "value": "Software Engineer. <br />  Year:  2025-curr."
        },
        {
          "label": "Thrasher's Family Holdings LLC",
          "value": "Software engineer working on two big projects, AmnestyOne, and Values Cart. <br />  Year:  2022-2025"
        },
        {
          "label": "Byte Masons",
          "value": "Blockchain apprentice software developer <br />  Year:  2023-2024"
        }
      ]
    },
    {
      "label": "projects",
      "about": "To know about my projects",
      "value": "I've had the pleasure of working on a diverse set of projects that showcase my skills and creativity.",
      "data": [
        {
          "label": "AmnestyOne",
          "value": "Built a platform showcasing political prisoner cases, empowering users to advocate for their release by sending handwritten letters to members of Congress through our website. Built using Bun, React, Next.js, Stripe, Postgres, and Vercel.",
          "url": "https://AmnestyOne.com"
        },
        {
          "label": "Concentrated Liquidity Compounder",
          "value": "Designed and developed a dynamic web3 e-commerce website, featuring several crypto investment strategies for concentrated liquidity compounders to grow customers savings.",
          "url": "https://nuked-defi.vercel.app/"
        },
        {
          "label": "Values Cart Chrome Extension",
          "value": "Created a chrome extension that intuitively influences consumer spending on Brands hosted on the Amazon marketplace.",
          "url": "https://valuescart.com/services"
        },
        {
          "label": "Values Cart Web Reputation System",
          "value": "Built the backend web reputation system for Values Cart which aligns customer spending with their ethical/political values using MySQL and Microsoft Azure.",
          "url": "https://valuescart.com/services"
        },
        {
          "label": "MIPS assembly calculator",
          "value": "Built a binary to hexadecimal to decimal conversion calculator written in the MIPS assembly language. I used bitmasking to do some of the conversions, and in the process learned about invisible line break characters.",
          "url": "https://github.com/miguelmendez1208/MipsConversionCalculator"
        }
      ]
    },
    {
      "label": "contact",
      "about": "To get my contact details",
      "value": "Feel free to reach out! You can contact me for any inquiries or collaborations. <br/> Email:  miguelmendez1208@gmail.com  <br/> GitHub:  https://github.com/miguelmendez1208  <br/> LinkedIn:  https://www.linkedin.com/in/mendez-miguel"
    }
  ]
}
